responseTemplates/SrvCaLiQu.xml

<ns1:Envelope xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns4="urn:ucbru:gbo:v4" xmlns:ns3="urn:ucbru:gbo:v5">
    <ns1:Header>
        <NS2:UCBRUHeaders xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:gbo="urn:ucbru:gbo:v4" xmlns:NS2="urn:ucbru:gbo:v4">
            <gbo:Audit>
                <gbo:MessagePath>
                    <gbo:Step>
                        <gbo:Application.Module>SRVCARD.CardListQuery</gbo:Application.Module>
                        <gbo:VersionId>v4</gbo:VersionId>
                        <gbo:TimeStamp>${generate.dateNow}</gbo:TimeStamp>
                        <gbo:RoutingRole>START</gbo:RoutingRole>
                        <gbo:Comment/>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>ACARDDetailsPRIME.CustomerCardsQuery</gbo:Application.Module>
                        <gbo:VersionId>v4</gbo:VersionId>
                        <gbo:TimeStamp>${generate.dateNow}</gbo:TimeStamp>
                        <gbo:RoutingRole>START</gbo:RoutingRole>
                        <gbo:Comment/>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>ACARDDetailsPRIME.CustomerCardsQuery</gbo:Application.Module>
                        <gbo:VersionId>v4</gbo:VersionId>
                        <gbo:TimeStamp>${generate.dateNow}</gbo:TimeStamp>
                        <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
                        <gbo:Comment/>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SRVCARD.CardListQuery</gbo:Application.Module>
                        <gbo:VersionId>v4</gbo:VersionId>
                        <gbo:TimeStamp>${generate.dateNow}</gbo:TimeStamp>
                        <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
                        <gbo:Comment/>
                    </gbo:Step>
                </gbo:MessagePath>
            </gbo:Audit>
        </NS2:UCBRUHeaders>
        <gbo:UCBRUHeaders xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:gbo="urn:ucbru:gbo:v3">
            <gbo:Audit>
                <gbo:MessagePath>
                    <gbo:Step>
                        <gbo:Application.Module>ATSCCARD.CreditCardsDetailsQuery.RequestHandler</gbo:Application.Module>
                        <gbo:VersionId>V3</gbo:VersionId>
                        <gbo:TimeStamp>${generate.dateNowWithoutTimezone}</gbo:TimeStamp>
                        <gbo:RoutingRole>START</gbo:RoutingRole>
                        <gbo:Comment/>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>ATSCCARD.CreditCardsDetailsQuery.ResponseHandler</gbo:Application.Module>
                        <gbo:VersionId>V3</gbo:VersionId>
                        <gbo:TimeStamp>${generate.dateNowWithoutTimezone}</gbo:TimeStamp>
                        <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
                        <gbo:Comment/>
                    </gbo:Step>
                </gbo:MessagePath>
            </gbo:Audit>
        </gbo:UCBRUHeaders>
    </ns1:Header>
    <ns1:Body>
        <ns4:CardList>
            <ns4:Card>
                <ns4:CardIdentifiers>
                    <ns4:ObjectType>CardIdentification</ns4:ObjectType>
                    <ns4:Identifier>
                        <ns4:Value>3${receive.id:-6}</ns4:Value>
                        <ns4:System>
                            <ns4:Name>PRIME</ns4:Name>
                            <ns4:Master>Y</ns4:Master>
                        </ns4:System>
                    </ns4:Identifier>
                    <ns4:Identifier>
                        <ns4:Value>A01ZDRC173590098</ns4:Value>
                        <ns4:System>
                            <ns4:Name>FCC</ns4:Name>
                            <ns4:Master>N</ns4:Master>
                        </ns4:System>
                    </ns4:Identifier>
                </ns4:CardIdentifiers>
                <ns4:CardNumber>462776******${receive.id:-4}</ns4:CardNumber>
                <ns4:Account>${AccountList.account6}</ns4:Account>
                <ns4:InternalAccountNumber>${receive.id}USDPRDC102</ns4:InternalAccountNumber>
                <ns4:CustomerNum>01130571</ns4:CustomerNum>
                <ns4:CardHolder>SEKAMOV VIKTORIYA</ns4:CardHolder>
                <ns4:Product>CE_PRIVATE</ns4:Product>
                <ns4:Tariff>150/150RUR</ns4:Tariff>
                <ns4:IsAdditionalCard>N</ns4:IsAdditionalCard>
                <ns4:NewCardDate>2017-12-26</ns4:NewCardDate>
                <ns4:DateCardReissued>2017-12-26</ns4:DateCardReissued>
                <ns4:DateValidCard>2021-12-31</ns4:DateValidCard>
                <ns4:Currency>840</ns4:Currency>
                <ns4:CardStatus>BLCK</ns4:CardStatus>
                <ns4:DrCr>D</ns4:DrCr>
                <ns4:AvailableBalance>190000</ns4:AvailableBalance>
                <ns4:IsActiveCardFlag>Y</ns4:IsActiveCardFlag>
                <ns4:UDF>
                    <ns4:Name>BlockedSum</ns4:Name>
                    <ns4:Value>0</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>PrimaryCardNumberMask</ns4:Name>
                    <ns4:Value>490855*3073</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>PrimaryCardId</ns4:Name>
                    <ns4:Value>3865699</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>Interestrate</ns4:Name>
                    <ns4:Value>0</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>HolderName</ns4:Name>
                    <ns4:Value>СЕКАМОВ ВИКТОРИЯ БРИГИТТА - -</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>CardBelongType</ns4:Name>
                    <ns4:Value>2</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>CardTypeId</ns4:Name>
                    <ns4:Value>4627760</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>CardStatusUDF</ns4:Name>
                    <ns4:Value>A</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>MAIN_CARD_CUST_NO</ns4:Name>
                    <ns4:Value>${receive.id}</ns4:Value>
                </ns4:UDF>
            </ns4:Card>
            <ns4:Card>
                <ns4:CardIdentifiers>
                    <ns4:ObjectType>CardIdentification</ns4:ObjectType>
                    <ns4:Identifier>
                        <ns4:Value>2${receive.id:-6}</ns4:Value>
                        <ns4:System>
                            <ns4:Name>PRIME</ns4:Name>
                            <ns4:Master>Y</ns4:Master>
                        </ns4:System>
                    </ns4:Identifier>
                    <ns4:Identifier>
                        <ns4:Value>oldA05ZDRC11172002A</ns4:Value>
                        <ns4:System>
                            <ns4:Name>FCC</ns4:Name>
                            <ns4:Master>N</ns4:Master>
                        </ns4:System>
                    </ns4:Identifier>
                </ns4:CardIdentifiers>
                <ns4:CardNumber>518996******${receive.id:-4}</ns4:CardNumber>
                <ns4:Account>${AccountList.account7}</ns4:Account>
                <ns4:InternalAccountNumber>${receive.id}RURPRDC101</ns4:InternalAccountNumber>
                <ns4:CustomerNum>${receive.id}</ns4:CustomerNum>
                <ns4:CardHolder>MARK SEKAMOV</ns4:CardHolder>
                <ns4:Product>XS_PRIVATE(R)</ns4:Product>
                <ns4:Tariff>500/500RUR</ns4:Tariff>
                <ns4:IsAdditionalCard>N</ns4:IsAdditionalCard>
                <ns4:NewCardDate>2017-06-19</ns4:NewCardDate>
                <ns4:DateCardReissued>2017-06-19</ns4:DateCardReissued>
                <ns4:DateValidCard>2021-06-30</ns4:DateValidCard>
                <ns4:Currency>643</ns4:Currency>
                <ns4:CardStatus>BLCK</ns4:CardStatus>
                <ns4:DrCr>D</ns4:DrCr>
                <ns4:AvailableBalance>42197.75</ns4:AvailableBalance>
                <ns4:IsActiveCardFlag>Y</ns4:IsActiveCardFlag>
                <ns4:UDF>
                    <ns4:Name>BlockedSum</ns4:Name>
                    <ns4:Value>0</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>PrimaryCardNumberMask</ns4:Name>
                    <ns4:Value>472446*0020</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>PrimaryCardId</ns4:Name>
                    <ns4:Value>4150580</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>Interestrate</ns4:Name>
                    <ns4:Value>0</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>HolderName</ns4:Name>
                    <ns4:Value>СЕКАМОВ МАРК АРКАДЬЕВИЧ</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>CardBelongType</ns4:Name>
                    <ns4:Value>2</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>CardTypeId</ns4:Name>
                    <ns4:Value>5189960</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>CardStatusUDF</ns4:Name>
                    <ns4:Value>A</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>MAIN_CARD_CUST_NO</ns4:Name>
                    <ns4:Value>${receive.id}</ns4:Value>
                </ns4:UDF>
            </ns4:Card>
            <ns4:Card>
                <ns4:CardIdentifiers>
                    <ns4:ObjectType>CardIdentification</ns4:ObjectType>
                    <ns4:Identifier>
                        <ns4:Value>1${receive.id:-6}</ns4:Value>
                        <ns4:System>
                            <ns4:Name>PRIME</ns4:Name>
                            <ns4:Master>Y</ns4:Master>
                        </ns4:System>
                    </ns4:Identifier>
                    <ns4:Identifier>
                        <ns4:Value>A05ZDRC123340002</ns4:Value>
                        <ns4:System>
                            <ns4:Name>FCC</ns4:Name>
                            <ns4:Master>N</ns4:Master>
                        </ns4:System>
                    </ns4:Identifier>
                </ns4:CardIdentifiers>
                <ns4:CardNumber>472446******${receive.id:-4}</ns4:CardNumber>
                <ns4:Account>${AccountList.account3}</ns4:Account>
                <ns4:InternalAccountNumber>${receive.id}USDPROC101</ns4:InternalAccountNumber>
                <ns4:CustomerNum>${receive.id}</ns4:CustomerNum>
                <ns4:CardHolder>MARK SEKAMOV</ns4:CardHolder>
                <ns4:Product>CI_PRIVATE-LOAN</ns4:Product>
                <ns4:Tariff>0</ns4:Tariff>
                <ns4:IsAdditionalCard>Y</ns4:IsAdditionalCard>
                <ns4:NewCardDate>2020-11-18</ns4:NewCardDate>
                <ns4:DateCardReissued>2020-11-18</ns4:DateCardReissued>
                <ns4:DateValidCard>2022-11-30</ns4:DateValidCard>
                <ns4:Currency>840</ns4:Currency>
                <ns4:CardStatus>NORM</ns4:CardStatus>
                <ns4:DrCr>C</ns4:DrCr>
                <ns4:AvailableBalance>82211.71</ns4:AvailableBalance>
                <ns4:GeneralDebt>0</ns4:GeneralDebt>
                <ns4:NextPmntGrace>0</ns4:NextPmntGrace>
                <ns4:CreditLimit>74300</ns4:CreditLimit>
                <ns4:Balance>7695.57</ns4:Balance>
                <ns4:MinAmount>0</ns4:MinAmount>
                <ns4:MinAmtDueDate>2016-11-27</ns4:MinAmtDueDate>
                <ns4:IsActiveCardFlag>Y</ns4:IsActiveCardFlag>
                <ns4:UDF>
                    <ns4:Name>Interestrate</ns4:Name>
                    <ns4:Value>16.5</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>HolderName</ns4:Name>
                    <ns4:Value>СЕКАМОВ МАРК АРКАДЬЕВИЧ</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>CardBelongType</ns4:Name>
                    <ns4:Value>2</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>CardTypeId</ns4:Name>
                    <ns4:Value>4724462</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>CardStatusUDF</ns4:Name>
                    <ns4:Value>A</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>UnBlockSum</ns4:Name>
                    <ns4:Value>0</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>BlockedSum</ns4:Name>
                    <ns4:Value>0</ns4:Value>
                </ns4:UDF>
            </ns4:Card>
            <ns4:Card>
                <ns4:CardIdentifiers>
                    <ns4:ObjectType>CardIdentification</ns4:ObjectType>
                    <ns4:Identifier>
                        <ns4:Value>4${receive.id:-6}</ns4:Value>
                        <ns4:System>
                            <ns4:Name>PRIME</ns4:Name>
                            <ns4:Master>Y</ns4:Master>
                        </ns4:System>
                    </ns4:Identifier>
                    <ns4:Identifier>
                        <ns4:Value>A01ZDRC141420055</ns4:Value>
                        <ns4:System>
                            <ns4:Name>FCC</ns4:Name>
                            <ns4:Master>N</ns4:Master>
                        </ns4:System>
                    </ns4:Identifier>
                </ns4:CardIdentifiers>
                <ns4:CardNumber>469362******${receive.id:-4}</ns4:CardNumber>
                <ns4:Account>${AccountList.account2}</ns4:Account>
                <ns4:InternalAccountNumber>${receive.id}RURPRPRM01</ns4:InternalAccountNumber>
                <ns4:CustomerNum>${receive.id}</ns4:CustomerNum>
                <ns4:CardHolder>MARK SEKAMOV</ns4:CardHolder>
                <ns4:Product>CS_SALARY-R(R)</ns4:Product>
                <ns4:Tariff>0+CB1-5-10</ns4:Tariff>
                <ns4:IsAdditionalCard>Y</ns4:IsAdditionalCard>
                <ns4:NewCardDate>2021-05-14</ns4:NewCardDate>
                <ns4:DateCardReissued>2021-05-14</ns4:DateCardReissued>
                <ns4:DateValidCard>2025-05-31</ns4:DateValidCard>
                <ns4:Currency>643</ns4:Currency>
                <ns4:CardStatus>NORM</ns4:CardStatus>
                <ns4:DrCr>D</ns4:DrCr>
                <ns4:AvailableBalance>53648.98</ns4:AvailableBalance>
                <ns4:IsActiveCardFlag>Y</ns4:IsActiveCardFlag>
                <ns4:UDF>
                    <ns4:Name>Interestrate</ns4:Name>
                    <ns4:Value>0</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>HolderName</ns4:Name>
                    <ns4:Value>СЕКАМОВ МАРК АРКАДЬЕВИЧ</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>CardBelongType</ns4:Name>
                    <ns4:Value>2</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>CardTypeId</ns4:Name>
                    <ns4:Value>7770240</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>CardStatusUDF</ns4:Name>
                    <ns4:Value>A</ns4:Value>
                </ns4:UDF>
                <ns4:UDF>
                    <ns4:Name>BlockedSum</ns4:Name>
                    <ns4:Value>136697.72</ns4:Value>
                </ns4:UDF>
            </ns4:Card>
        </ns4:CardList>
    </ns1:Body>
</ns1:Envelope>